// приведення логічних операторів

// false === false;
// null === false;
// undefined === false;
// "" === false;
// 0 === false;

// оператори порівняння <, >, >=, <=, ===, == / unicode

// && - зупиняється не брехні
// перевіряє всі операнди і якщо зустрічає брехню то повертає значення цього операнда
// інакше повертає значення останнього операнда

// || - зупиняється не правді
// перевіряє всі операнди і якщо зустрічає правду то повертає значення цього операнда
// інакше повертає значення останнього операнда

// ! - інверує значення правди в брехню і брехню в правду

// console.log(true && 3);
// console.log(false && 3);
// console.log(true && 4 && "polo");
// console.log(true && null && "polo");
// console.log("" && null && "polo");
// console.log("polo" || null || 0);
// console.log("polo" && null && 0 > 0);
// console.log("polo" || ("null" && 5) || 32);
