"use strict";
/*
    Цикли (while, do while, for)
*/

/*
   while
*/

/*
    while (condition) {
      // код, тіло циклу (statement)
    }
*/
// Приклад з покроковим розбором
// let i = 0;
// while (i < 5) {
//   i += 1;
// }

/*
 - Виведіть числа від 1 до 50
*/

/*
 - Знайдіть суму чисел від 1 до 100
*/

/*
 - Дано число n=1000
 - Поділіть його на 2 стільки раз поки результат від ділення не стане менше 50
 - Яке число вийде
 - Порахуйте кількість ітерацій необхідних для цього та запишіть її в змінну num
*/

/*
    do while
*/

/*
    do {
        // statement
    } while (condition);
*/

// Приклад

/*
 - Напишіть цикл який пропонує ввести число більше 100
 - Якщо користувач ввів число менше 100, попросити його ввести число ще раз
 - Цикл повинен працювати до поки користувач не введе число більше 100
 - Припускається що користувач вводить тільки числа
*/

/*
    for
*/

/*
    for (ініціалізація; умова; пост-вираз) {
     // тіло цикла
    }
*/

// Приклад


/*
 - За допомогою цикла for виведіть парні числа від 2 до 35
*/

/*
 - Напишіть програму яка виводить в консоль числа від 1 до 100 з деякими виключеннями
 - Для чисел які діляться на 3 вивести значення "Fizz"
 - Для чисел які діляться на 5 - "Buzz"
 - Для чисел які діляться і на 3 і на 5 - "FizzBuzz"
*/

// 2й спосіб через конкатенацію

/*
 - Виведіть методом concole.log() зірочки від 1 до 7 штук в вигляді трикутника таким чином
 *
 **
 ***
 ****
 *****
 ******
 *******
*/
