"use strict";

/*
  Функціональні вирази та оголошення функції.
  Параметри, аргументи, повернення.
*/

// function назва_функції() {
//   Тіло функції
// }

// function showNessage(){}

/*
  Напиши функцію calcBMI(wheit, height) яка розраховує і повертає індекс маси тіла людини.
  Для цього необхідно розділити вагу в кілограмах на квдрат зросту людини в метрах.
  Вага та зріст будуть спеціально передані як строки. Нецілі числа можуть бути задані 
  в вигляді 24.7 або 24,7, тобто в якості розділювача дробної частини може бути кома.
  Індекс маси тіла потрібно округлити до одного знаку після коми
*/

/*
  Напиши функцію min(a,b), яка повертає менше із чисел a і b.
*/

/*
  Напиши функцію getRectArea(dimensions) для визначення площі прямокутника знаачення 
  якого будуть передані в параметр dimensions в вигляді строки.
  Значення гарантовано розділені пробілом.
*/

/*
  Напиши функцію logItems(items), яка отримує масив та використовє цикл for,
  який для кожного елемента масива буде виводить в консоль повідомлення в 
  форматі "номер_елемента - значення_елемента".
  Нумерація повинна починатися з 1.
  Наприклад для першого елемента масива ["Mango", "Poly", "Ajax"] з індексом 0 буде виведено
  1 -  "Mango"
*/

// logItems(["Mango", "Poly", "Ajax"]);
// logItems(["Apple", "Lemon", "Pear", "Cherry", "Strawberries"]);

/*
  Напиши функцію printContactsInfo(names, phones), яка виводить в консоль ім'я та 
  телефонний номер користувача.
  В пареметри names та phones будуть передані строки імен та номерів розділеених комами.
  Порядковий номер імен та телефонів в стоках вказує на відповідність.
  Кількість імен та номерів гаронотовано однакова.
*/

// printContactsInfo(
//   "Bob,Mark,Bart,Jack",
//   "89001234567,89001234467,89001238567,89001204567"
// );

// printContactsInfo(
//   "Tory,Rosie,Berta,Cary",
//   "89001434567,89001238467,89001338567,89001207567"
// );

/*
  Напиши функцію findLargestNumber(numbers) яка шукає найбільше число в масиві.  
*/

// console.log(findLargestNumber([21, 15, 7, 35, 60, 22])); // 60
// console.log(findLargestNumber([33, 98, 14, 43, 54, 81, 7])); // 98

/*
  Напиши функцію calcAverage() яка приймає довільну кількість чисел та 
  визначає їх середнє значення.
  Всі аргументи будуть тільки числами.
*/

// console.log(calcAverage(1, 2, 3, 4)); // 2.5
// console.log(calcAverage(5, 6, 7, 8)); // 13
// console.log(calcAverage(15, 12, 3)); // 15

/*
  Напишіть функції для роботи з колекцією навчальних курсів courses:
  addCourse(name) - додає курс в кінець колекції,
  removeCourse(name) - видаляє курс із колекції,
  updateCourse(oldName, newName) - змінює ім'я на нове,
  В усіх функціях зробити "захист від дурня".
*/

// const course = ["HTML", "JS", "React", "Node", "PostgreSQL"];

// addCourse("Node"); // У вас вже є курс Node
// addCourse("Python");
// console.log(courses); // ["HTML", "JS", "React", "Node", "PostgreSQL", "Python" ]

// removeCourse("ProjectManagment"); // Курса з такою назвою не знайдено
// removeCourse("PostgreSQL");
// console.log(courses); // ["HTML", "JS", "React", "Node", "Python" ]


// updateCourse("С++", "PHP"); // Курса C++ не знайдено. Додано новий курс PHP. 
// updateCourse("HTML", "HTML/CSS");
// console.log(courses); // ["HTML/CSS", "JS", "React", "Node", "Python" ]



