"use strict";

// Розгалуження if

// if (умова) {
//     // тіло if
//   }

// if
// if..else

/**
 - Дана строка яка складається з символів "qwerty"
 - Перевірте що першим символом є буква "q". 
 - Якщо це так, то виведіть - Так, якщо ні, то виведіть Ні
*/

/*
 - Запрсоти у користувача число
 - Якщо число дорівнює 10, то вивести "Вірно"
 - Інакше - вивести "Не вірно"
*/

/*
 - В змінній min знаходиться число від 0 до 59
 - Визначте в яку четверть години входить дане число(I, II, III, IV)
 - [0-15) -> I-четверть
 - [15-30) -> II-четверть
 - [30-45) -> III-четверть
 - [45-60) -> IV-четверть
*/

/*
 - Напишіть код який буде запитувати "Яка "офіційну" назву JavaScript?"
 - Якщо користувач вводить ECMAScript, то показать "Вірно"
 - Інакше показать "Не знаєте? ECMAScript"
*/

/*
 - Напишіть код, який буде запитувати у користувача "Введіть число", а потім виводить в консоль:
    1 - якщо більше нуля
    -1 - якщо менше нуля
    0 - якщо дорівнює нулю
    користувач вводить тільки числа
*/

/*
    switch/case
*/

/*
    switch (значення) {
      case значення:
        інструкції;
        break;
          
      case значення:
        інструкції;
        break;
          
      default:
        інструкції;
    }
*/

// Приклад

/*
 - Напишіть код який буде описувати роботу світлофора
 - Якщо в значення приходить "red" - покажіть "Зараз горить червоний"
 - Якщо в значення приходить "orange" - покажіть "Зараз горить жовтий"
 - Якщо в значення приходить "green" - покажіть "Зараз горить зелений"
 - Інакше покажіть "Перехрестя не ругульоване"
*/

/*
 - Тернарний оператор
*/

/*
    ?
    :
*/

// Приклад

/*
 - Перепишіть код з if..else за допомогою тернарного оператора
*/

/*
 - Перепишіть код з if..else if за допомогою тернарного оператора
*/

/*
    Область видимості
*/
