'use strict';
// Створення новой дати

// Методи дати get,set

//? TASK 01
// Створіть об'єкт Date для даты: 20 лютого 2012 года, 3 години 12 хвилин. Часова зона – місцева.

// console.log(date);

//? TASK 02
// Напишіть функцию getWeekDay(date), показывающую день недели в коротком формате:
// «ПН», «ВТ», «СР», «ЧТ», «ПТ», «СБ», «НД».

// const date = new Date();
// console.log(getWeekDay(date));

//? TASK 03
// Напишіть функцію getLastDayOfMonth(year, month), яка повертає останнє число місяця. Інколи це 30, 31 або навіть лютневі 28/29.
// Параметри:
// year – рік з четирьох цифр, наприклад, 2012.
// month – місяць від 0 до 11.
// Наприклад, getLastDayOfMonth(2012, 1) = 29 (високосний рік, лютий).

// console.log(getLastDayOfMonth(2022, 4));

//? TASK 04
// Створіть функцію getSecondsToTomorrow(), яка повертає к-сть секунд до завтрашньої дати.

// getSecondsToTomorrow();
